Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkSymbol Constructor (SectionMarkBase.SectionMarkSymbol.SymbolShapes, Double, Point)
 Creates a new section mark symbol instance with the given shape, size and position.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SectionMarkSymbol(
	SectionMarkBase.SectionMarkSymbol.SymbolShapes shape,
	double size,
	Point position
)
Public Sub New (
	shape As SectionMarkBase.SectionMarkSymbol.SymbolShapes,
	size As Double,
	position As Point
)
Parameters
shape
Type: Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.SymbolShapes
The shape of the section mark symbol to be used.
size
Type: System.Double
The size of the section mark symbol to be used.
position
Type: Tekla.Structures.Geometry3d.Point
The position of the section mark symbol to be used.
See Also
Reference
SectionMarkBase.SectionMarkSymbol Class
SectionMarkBase.SectionMarkSymbol Overload
Tekla.Structures.Drawing Namespace